src/InformationRegisters/ОписаниеНоменклатурыИС/ОписаниеНоменклатурыИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписаниеНоменклатурыИС</name>
  <resources>
    <name>ЕмкостьПотребительскойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВПотребительскойУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантЧастичногоВыбытия</name>
    <type>
      <types>EnumRef.ВариантыУчетаЧастичногоВыбытияИС</types>
    </type>
  </resources>
  <resources>
    <name>ВариантИспользованияЕдиницыХранения</name>
    <type>
      <types>EnumRef.ВариантыИспользованияЕдиницыХраненияИС</types>
    </type>
  </resources>
  <resources>
    <name>ПотребительскаяУпаковка</name>
    <type>
      <types>DefinedType.Упаковка</types>
    </type>
  </resources>
  <resources>
    <name>УпаковкаЧастичногоВыбытия</name>
    <type>
      <types>DefinedType.Упаковка</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.ИсточникОписанияНоменклатурыИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОписаниеНоменклатурыИС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Сохраняет описание номенклатуры
//
// Параметры:
//   ДанныеОписания    - см. ОбщегоНазначенияИС.ИнициализироватьДанныеОписанияНоменклатуры.
//   СохраненныеДанные - см. ОбщегоНазначенияИС.ИнициализироватьДанныеОписанияНоменклатуры.
Процедура УстановитьОписание(ДанныеОписания, СохраненныеДанные = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(ДанныеОписания.Номенклатура, Истина);

	Если СохраненныеДанные = Неопределено Тогда
		НаборЗаписей.Прочитать();
	КонецЕсли;

	Если НаборЗаписей.Выбран() И СохраненныеДанные = Неопределено Тогда

		Если НаборЗаписей.Количество() Тогда
			ЗаписьНабора = НаборЗаписей[0];
		Иначе
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.Номенклатура = ДанныеОписания.Номенклатура;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ЕмкостьПотребительскойУпаковки")
			И ДанныеОписания.ЕмкостьПотребительскойУпаковки <> Неопределено Тогда
			ЗаписьНабора.ЕмкостьПотребительскойУпаковки = ДанныеОписания.ЕмкостьПотребительскойУпаковки;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "КоличествоВПотребительскойУпаковке")
			И ДанныеОписания.КоличествоВПотребительскойУпаковке <> Неопределено Тогда
			ЗаписьНабора.КоличествоВПотребительскойУпаковке = ДанныеОписания.КоличествоВПотребительскойУпаковке;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ВариантЧастичногоВыбытия")
			И ДанныеОписания.ВариантЧастичногоВыбытия <> Неопределено Тогда
			ЗаписьНабора.ВариантЧастичногоВыбытия = ДанныеОписания.ВариантЧастичногоВыбытия;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ВариантИспользованияЕдиницыХранения")
			И ДанныеОписания.ВариантИспользованияЕдиницыХранения <> Неопределено Тогда
			ЗаписьНабора.ВариантИспользованияЕдиницыХранения = ДанныеОписания.ВариантИспользованияЕдиницыХранения;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ПотребительскаяУпаковка")
			И ДанныеОписания.ПотребительскаяУпаковка <> Неопределено Тогда
			ЗаписьНабора.ПотребительскаяУпаковка = ДанныеОписания.ПотребительскаяУпаковка;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "УпаковкаЧастичногоВыбытия")
			И ДанныеОписания.УпаковкаЧастичногоВыбытия <> Неопределено Тогда
			ЗаписьНабора.УпаковкаЧастичногоВыбытия = ДанныеОписания.УпаковкаЧастичногоВыбытия;
		КонецЕсли;

	ИначеЕсли СохраненныеДанные <> Неопределено Тогда

		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, ДанныеОписания);

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ЕмкостьПотребительскойУпаковки")
			И ДанныеОписания.ЕмкостьПотребительскойУпаковки = Неопределено Тогда
			ЗаписьНабора.ЕмкостьПотребительскойУпаковки = СохраненныеДанные.ЕмкостьПотребительскойУпаковки;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "КоличествоВПотребительскойУпаковке")
			И ДанныеОписания.КоличествоВПотребительскойУпаковке = Неопределено Тогда
			ЗаписьНабора.КоличествоВПотребительскойУпаковке = СохраненныеДанные.КоличествоВПотребительскойУпаковке;
		КонецЕсли;

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ВариантЧастичногоВыбытия")
			И ДанныеОписания.ВариантЧастичногоВыбытия = Неопределено Тогда
			ЗаписьНабора.ВариантЧастичногоВыбытия = СохраненныеДанные.ВариантЧастичногоВыбытия;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ВариантИспользованияЕдиницыХранения")
			И ДанныеОписания.ВариантИспользованияЕдиницыХранения = Неопределено Тогда
			ЗаписьНабора.ВариантИспользованияЕдиницыХранения = СохраненныеДанные.ВариантИспользованияЕдиницыХранения;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "ПотребительскаяУпаковка")
			И ДанныеОписания.ПотребительскаяУпаковка = Неопределено Тогда
			ЗаписьНабора.ПотребительскаяУпаковка = СохраненныеДанные.ПотребительскаяУпаковка;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОписания, "УпаковкаЧастичногоВыбытия")
			И ДанныеОписания.УпаковкаЧастичногоВыбытия = Неопределено Тогда
			ЗаписьНабора.УпаковкаЧастичногоВыбытия = СохраненныеДанные.УпаковкаЧастичногоВыбытия;
		КонецЕсли;
		
	Иначе

		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, ДанныеОписания);

	КонецЕсли;

	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
